Rhino.Inside.Revit API
GeometryEncoder.ToUV Method
Overload List
Name | Description
ToUV(Point2d)
 Converts the specified Rhino.Geometry.Point2d to an equivalent Autodesk.Revit.DB.UV.
ToUV(Point2f)
 Converts the specified Rhino.Geometry.Point2f to an equivalent Autodesk.Revit.DB.UV.
ToUV(Vector2d)
 Converts the specified Rhino.Geometry.Vector2d to an equivalent Autodesk.Revit.DB.UV.
ToUV(Vector2f)
 Converts the specified Rhino.Geometry.Vector2f to an equivalent Autodesk.Revit.DB.UV.
Top
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace